In [ ]:
%load_ext sql

In [ ]:
%sql sqlite://

# Test

In [ ]:
%%sql
DROP TABLE IF EXISTS Student;
CREATE TABLE Student (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    year INTEGER,
    teacher_id INTEGER
);
INSERT INTO Student(name, teacher_id, year) VALUES 
    ('Bob', 0, 2022),
    ('Jane', 0, 2023),
    ('John', 1, 2022);
    
DROP TABLE IF EXISTS Teacher;
CREATE TABLE Teacher (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT
);
INSERT INTO Teacher(name) VALUES
    ('Janice'),
    ('Zuck');

In [ ]:
%%sql
SELECT *
FROM Student
JOIN Teacher ON Student.teacher_id = Teacher.id
WHERE Student.name LIKE '%o%'
GROUP BY year;

# 9.4 JOINs

In [ ]:
%%sql
DROP TABLE IF EXISTS Breed;
CREATE TABLE Breed (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL
);
INSERT INTO Breed (name) VALUES
    ('Corgi'),
    ('Bernese'),
    ('Bulldog');
    
DROP TABLE IF EXISTS Pet;
CREATE TABLE Pet (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    breed_id INTEGER NOT NULL,
    name TEXT NOT NULL
);
INSERT INTO Pet (breed_id, name) VALUES
    (1, 'Apricot'),
    (2, 'Boots');

In [ ]:
%%sql
SELECT *
FROM Pet AS p, Breed AS b;

In [ ]:
%%sql
SELECT *
FROM Pet AS p
JOIN Breed AS b
    ON p.breed_id = b.id;

In [ ]:
%%sql
SELECT *
FROM Pet AS p, Breed AS b
WHERE p.breed_id = b.id;

In [ ]:
%%sql
SELECT *
FROM Breed AS b
LEFT JOIN Pet AS p
    ON p.breed_id = b.id;

In [ ]:
%%sql
CREATE TABLE Student (
    age INTEGER PRIMARY KEY,
    name TEXT NOT NULL
);
INSERT INTO Student VALUES
    (29, 'Jameel'),
    (37, 'Jian'),
    (20, 'Emma');
    
CREATE TABLE Teacher (
    age INTEGER PRIMARY KEY,
    name TEXT NOT NULL
);
INSERT INTO Teacher VALUES
    (52, 'Ira'),
    (27, 'John'),
    (36, 'Anuja');

In [ ]:
%%sql
SELECT *
FROM Student as s
JOIN Teacher as t
     ON s.age > t.age;

In [ ]:
%%sql
DROP TABLE IF EXISTS Penguin;
CREATE TABLE Penguin (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL,
    height INTEGER NOT NULL,
    age INTEGER NOT NULL
);
INSERT INTO Penguin (name, height, age) VALUES 
    ('Alice', 3.6, 10),
    ('Bob', 4.0, 15),
    ('Cassie', 3.8, 5),
    ('Dahlia', 3.5, 10),
    ('Eve', 4.2, 5),
    ('Fred', 4.0, 12),
    ('Glen', 4.1, 9);

In [ ]:
%%sql
SELECT *
FROM Penguin AS child
JOIN Penguin AS parent
    ON child.age < parent.age;

# 9.5 NULLs

In [ ]:
%%sql
DROP TABLE IF EXISTS Penguin;
CREATE TABLE Penguin(
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    height INTEGER
);
INSERT INTO Penguin (name, height) VALUES
    ('Alice', 10),
    ('Bob', 11),
    ('Cassie', 8),
    (NULL, NULL);

In [ ]:
%sql SELECT * FROM Penguin;

In [ ]:
%%sql
SELECT *
FROM Penguin
WHERE name = NULL;

In [ ]:
%%sql
SELECT name = NULL
FROM Penguin;

In [ ]:
%%sql
SELECT name < NULL
FROM Penguin;

In [ ]:
%%sql
SELECT name > NULL
FROM Penguin;

In [ ]:
%%sql
SELECT name IS NULL
FROM Penguin;

In [ ]:
%%sql
SELECT name IS NOT NULL
FROM Penguin;

In [ ]:
%%sql
SELECT *
FROM Penguin
WHERE name IS NOT NULL;

In [ ]:
%%sql
SELECT SUM(height)
FROM Penguin;

In [ ]:
%%sql
SELECT COUNT(name)
FROM Penguin;

In [ ]:
%%sql
SELECT COUNT(*)
FROM Penguin;

# 9.6 Subsampling

In [ ]:
%%sql
DROP TABLE IF EXISTS Penguin;
CREATE TABLE Penguin (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL,
    height INTEGER NOT NULL,
    age INTEGER NOT NULL
);
INSERT INTO Penguin (name, height, age) VALUES 
    ('Alice', 3.6, 10),
    ('Bob', 4.0, 15),
    ('Cassie', 3.8, 5),
    ('Dahlia', 3.5, 10),
    ('Eve', 4.2, 5),
    ('Fred', 4.0, 12),
    ('Glen', 4.1, 9);

In [ ]:
%%sql
SELECT * FROM Penguin LIMIT 3;

In [ ]:
%%sql
SELECT *
FROM Penguin
ORDER BY height
LIMIT 3;

In [ ]:
%%sql
SELECT *
FROM Penguin
ORDER BY RANDOM()
LIMIT 3;

In [ ]:
%%sql
SELECT age
FROM Penguin
GROUP BY age
ORDER BY RANDOM()
LIMIT 3;

In [ ]:
%%sql
SELECT *
FROM Penguin
WHERE age IN (
    SELECT age
    FROM Penguin
    GROUP BY age
    ORDER BY RANDOM()
    LIMIT 3
);

In [ ]:
%%sql
WITH ages AS (
    SELECT age
    FROM Penguin
    GROUP BY age
    ORDER BY RANDOM()
    LIMIT 3
)
SELECT *
FROM Penguin
WHERE age in ages;

In [ ]:
%%sql
WITH children AS (
    SELECT id
    FROM Penguin
    ORDER BY RANDOM()
    LIMIT 3
)
SELECT *
FROM Penguin AS child
JOIN Penguin AS parent
    ON child.age < parent.age
WHERE child.id IN children;

# 9.7 Practice

In [ ]:
%%sql
DROP TABLE IF EXISTS Breed;
CREATE TABLE Breed (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL,
    lifespan INTEGER NOT NULL
);
INSERT INTO Breed (name, lifespan) VALUES
    ('Corgi', 15),
    ('Bernese', 8),
    ('Husky', 12),
    ('Bulldog', 10);

DROP TABLE IF EXISTS Dog;
CREATE TABLE Dog(
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    breed_id INTEGER NOT NULL,
    name TEXT NOT NULL,
    height INTEGER NOT NULL,
    parent_id INTEGER
);
INSERT INTO Dog (breed_id, name, height, parent_id) VALUES
    (1, 'Apricot', 11, NULL),
    (2, 'Maxie', 25, NULL),
    (1, 'Charlie', 8, 1),
    (3, 'Maya', 24, 1),
    (1, 'Dixie', 9, 1);

In [ ]:
%sql SELECT * FROM Breed;

In [ ]:
%sql SELECT * FROM Dog;

## 9.7.1 Queries

In [ ]:
%%sql
-- For each dog, report the name and expected lifespan.
SELECT Dog.name, Breed.lifespan
FROM Dog
JOIN Breed
    ON Dog.breed_id = Breed.id;

In [ ]:
%%sql
--For each dog, report the name of that dog’s parent.
SELECT Child.name, Parent.name
FROM Dog as Child
JOIN Dog as Parent
    ON Parent.id = Child.parent_id;

In [ ]:
%%sql
--Report the number of dogs for each breed.
SELECT Breed.name, COUNT(DISTINCT Dog.id)
FROM Breed
LEFT JOIN Dog
    ON Dog.breed_id = Breed.id
GROUP BY Breed.id;

## 9.7.2 Advanced Queries

In [ ]:
%%sql
--Report the average height for each breed’s children and parents, separately.
SELECT
    Breed.name,
    AVG(Child.height)
FROM Breed
JOIN Dog AS Child
    ON Child.breed_id = Breed.id
JOIN Dog as Parent
	ON Child.parent_id = Parent.id
GROUP BY Breed.id;

In [ ]:
%%sql
--Report number of possible playmates (same breed, within 1” height) per breed.
SELECT Dog1.name, Dog2.name
FROM Dog AS Dog1
JOIN Dog AS Dog2
    ON ABS(Dog1.height - Dog2.height) <= 1
    AND Dog1.breed_id = Dog2.breed_id
JOIN Breed
	ON Dog1.breed_id = Breed.id
WHERE Dog1.id > Dog2.id;

In [ ]:
%%sql
--Report the average height for each dog family.
--One family is just Maxie (25). The other 4 dogs are all in the same family AVG(11 + 8 + 24 + 9) = 13
SELECT
    AVG(height),
    CASE
        WHEN Dog.parent_id IS NULL THEN Dog.id
        ELSE Dog.parent_id
    END AS family_id 
FROM Dog
GROUP BY family_id;

In [ ]:
%%sql
SELECT name
FROM Dog
WHERE parent_id IS NULL;

In [ ]:
%%sql
--Report the average height for each dog family.
--One family is just Maxie (25). The other 4 dogs are all in the same family AVG(11 + 8 + 24 + 9) = 13
SELECT
    AVG(Dog.height),
    Parent.name,
    CASE
        WHEN Dog.parent_id IS NULL THEN Dog.id
        ELSE Dog.parent_id
    END AS family_id
FROM Dog
JOIN Dog As Parent
    ON family_id = Parent.id
GROUP BY family_id;

## 9.7.3 Debug Queries

In [ ]:
%%sql
--syntax error
SELECT lifespan, COUNT(*),
FROM Breed
JOIN Dog
    ON Dog.breed_id = Breed.id
GROUP BY lifespan;

In [ ]:
%%sql
--fix the above error
SELECT lifespan, COUNT(*)
FROM Breed
JOIN Dog
    ON Dog.breed_id = Breed.id
GROUP BY lifespan;

In [ ]:
%%sql
--wrong way of randomly selecting letters, then selecting all dogs for that letter
SELECT name, SUBSTR(name, 1, 1) as 'first'
FROM Dog
GROUP BY first
ORDER BY RANDOM()
LIMIT 2;

In [ ]:
%%sql
--still wrong! sometimes only 1 letter shows up
WITH Letter AS (
    SELECT SUBSTR(name, 1, 1) AS 'first'
    FROM Dog
    ORDER BY RANDOM()
    LIMIT 2
)
SELECT name
FROM Dog
WHERE SUBSTR(name, 1, 1) IN Letter;

In [ ]:
%%sql
--correct way of randomly selecting letters, then selecting all dogs for that letter
WITH Letter AS (
    SELECT DISTINCT SUBSTR(name, 1, 1) AS 'first'
    FROM Dog
    ORDER BY RANDOM()
    LIMIT 2
)
SELECT name
FROM Dog
WHERE SUBSTR(name, 1, 1) IN Letter;

In [ ]:
%%sql
SELECT
    AVG(height),
    FLOOR(lifespan / 7) AS 'age'
FROM Dog
JOIN Breed
    ON Dog.breed_id = Breed.id
GROUP BY age;

--OR the following, which has a nicer display
SELECT
    AVG(height),
    CASE 
        WHEN 15 <= lifespan AND lifespan <= 22 THEN '15-22'
        WHEN 7 <= lifespan AND lifespan <= 14 THEN '7-14'
        ELSE NULL
    END AS 'age'
FROM Dog
JOIN Breed
    ON Dog.breed_id = Breed.id
GROUP BY age;

In [ ]:
%%sql
SELECT Breed.name, MAX(height)
FROM Dog
JOIN Breed
    ON Dog.breed_id = Breed.id
GROUP BY Breed.id
ORDER BY RANDOM()
LIMIT 2;

In [ ]:
%%sql
--wrong way of selecting tallest dog for 2 random breeds (sometimes, only 1 breed shows up)
WITH SampleBreed AS (
    SELECT id
    FROM Breed
    ORDER BY RANDOM()
    LIMIT 2
)
SELECT Dog.name, MAX(Dog.height)
FROM Dog
JOIN SampleBreed
	ON Dog.breed_id = SampleBreed.id
GROUP BY SampleBreed.id;

In [ ]:
%%sql
--fixes sampling 2 random breeds by ignoring breeds with no dogs
WITH SampleBreed AS (
    SELECT Breed.id, Breed.name
    FROM Breed
    JOIN Dog
        ON Dog.breed_id = Breed.id
    GROUP BY Breed.id
    ORDER BY RANDOM()
    LIMIT 2
)
SELECT Dog.name, SampleBreed.name, MAX(Dog.height)
FROM Dog
JOIN SampleBreed
	ON Dog.breed_id = SampleBreed.id
GROUP BY SampleBreed.id;

In [ ]:
%%sql
--slower query for finding tallest child dog
SELECT Child.name, Child.height
FROM Dog as Child
JOIN Dog as Parent
	ON Parent.id = Child.parent_id
ORDER BY Child.height desc
LIMIT 1;

In [ ]:
%%sql
--faster query for finding tallest child dog
SELECT name, height
FROM Dog
WHERE parent_id IS NOT NULL
ORDER BY height DESC
LIMIT 1;

In [1]:
%load_ext sql
%sql sqlite://

In [4]:
%%sql
CREATE TABLE staff_reviews(
    staff_member TEXT NOT NULL,
    restaurant TEXT NOT NULL,
    type TEST NOT NULL,
    rating INTEGER NOT NULL,
    price INTEGER NOT NULL
);

 * sqlite://
Done.

[]

In [8]:
%%sql
INSERT INTO staff_reviews (staff_member, restaurant, type, rating, price) VALUES 
    ('andrew', 'imm_thai', 'thai', 4.5, 15),
    ('akshara', 'great_china', 'chinese', 4.0, 14),
    ('kelly', 'sliver', 'pizza', 5, 10),
    ('akshara', 'sliver', 'pizza', 4.5, 10),
    ('andrew', 'sliver', 'pizza', 5, 10),
    ('connie', 'sliver', 'pizza', 4, 10),
    ('andrew', 'kimchi_garden', 'korean', 4, 13),
    ('andrew', 'kimchi_garden', 'korean', 5, 13),
    ('andrew', 'kimchi_garden', 'korean', 5, 13),
    ('andrew', 'la_burrita', 'mexican', 4, 10),
    ('kunal', 'la_burrita', 'mexican', 4.5, 10),
    ('kelly', 'la_burrita', 'mexican', 5, 12),
    ('akshara', 'imm_thai', 'thai', 4, 13);

 * sqlite://
13 rows affected.

[]

In [10]:
%%sql
SELECT * FROM staff_reviews LIMIT 4;

 * sqlite://
Done.

[('andrew', 'imm_thai', 'thai', 4.5, 15),
 ('akshara', 'great_china', 'chinese', 4, 14),
 ('kelly', 'sliver', 'pizza', 5, 10),
 ('akshara', 'sliver', 'pizza', 4.5, 10)]

In [11]:
%%sql    
CREATE TABLE agg_reviews AS
    SELECT restaurant, AVG(rating) AS avg_rating, COUNT(*) AS num_ratings, AVG(price) AS avg_price
        FROM staff_reviews
        GROUP BY restaurant;

 * sqlite://
Done.

[]

In [13]:
%%sql
SELECT * FROM agg_reviews LIMIT 2;

 * sqlite://
Done.

[('great_china', 4.0, 1, 14.0), ('imm_thai', 4.25, 2, 14.0)]

In [ ]:
%%sql
SELECT agg.restaurant, avg_rating 
  FROM agg_reviews AS agg
  CROSS JOIN 
    (SELECT MAX(avg_rating) AS max_rating
       FROM agg_reviews) max
  WHERE avg_rating = max_rating;

In [ ]:
%%sql
SELECT restaurant, AVG(rating) AS avg_rating
    FROM staff_reviews
    WHERE restaurant NOT LIKE "%t%"
    GROUP BY restaurant
    HAVING COUNT(*) > 2 AND AVG(rating) >= 4.5;